---
kind: property
id: P:Autodesk.Revit.DB.ExternallyTaggedGeometryObject.IsValidObject
source: html/dd9b1286-99ac-1a54-e3d3-00d9f85432e7.htm
---
# Autodesk.Revit.DB.ExternallyTaggedGeometryObject.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.